app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)
    return render json: { status: :created, location: @cliente } if @cliente.save
---
INSERT INTO "clientes" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "AchieveMore"], ["created_at", "2019-09-06 15:57:28.449280"], ["updated_at", "2019-09-06 15:57:28.449280"]]

  def update
    return render json: { status: :ok, location: @cliente } if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "nome" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["nome", ""], ["updated_at", "2019-09-06 18:10:32.120793"], ["id", 61]]