app/controllers/resultados_controller.rb

SELECT "resultados".* FROM "resultados"
---
  def index
    @resultados = Resultado.all

INSERT INTO "resultados" ("periodo", "valor_meta", "valor_realizado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["periodo", "2019-09-06"], ["valor_meta", 10.0], ["valor_realizado", 12.0], ["created_at", "2019-09-06 18:13:51.092644"], ["updated_at", "2019-09-06 18:13:51.092644"]]
---
  def create
    @resultado = Resultado.new(resultado_params)

    if @resultado.save

DELETE FROM "resultados" WHERE "resultados"."id" = ?  [["id", 6]]
---
  def destroy
    @resultado.destroy

SELECT  "resultados".* FROM "resultados" WHERE "resultados"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_resultado
      @resultado = Resultado.includes(:cliente).find(params[:id])